OpenFOAM-11/etc/templates/closedVolumeRotating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol         0;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-2;
        relTol          0;

    }

    Phi
    {
        $p;
    }

    MeshPhi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-2;
        relTol          0;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

// timeScheme = steadyState for a steady-state simulation; otherwise transient
timeScheme $fvSchemes!ddtSchemes/default;

PIMPLE
{
#ifeq $timeScheme steadyState
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon)" 1e-4;
    }
#else
    correctPhi          yes;
    correctMeshPhi      yes;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
#endif

    pRefCell        0;
    pRefValue       0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

#ifeq $timeScheme steadyState
relaxationFactors
{
    // Steady-state relaxation factors
    fields
    {
        p     0.3;
    }
    equations
    {
        U     0.7;
        "(k|omega|epsilon)" 0.7;
    }
}
#else
relaxationFactors
{
    // Transient relaxation factors
    equations
    {
        ".*"  1;
    }
}
#endif

// ************************************************************************* //
